In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv('/home/lf/mysql_data/100.csv')

tmp = df.head(10)

In [3]:
tmp[-(tmp['money']>=10000)].dtypes

job_place    object
money         int64
dtype: object

In [4]:
a_values=[['小明','male',18,170,60,'北京海淀',61],
          ['小华','female',28,160,50,'上海静安',74],
          ['小红','female',22,175,64,'广州天河',59],
          ['小青','male',31,182,80,'深圳南山',82],
          ['小兰','female',25,165,65,'杭州西湖',98]]

In [5]:
a= pd.DataFrame(a_values,index=[1,2,3,4,5],columns=['name','sex','age','height','weight','address','grade'])

In [6]:
b = a.copy()

In [7]:
b.loc['aaa']=['小芳','female',24,164,52,'美国加州',55]

In [8]:
b.drop('aaa',axis=0)

  name     sex  age  height  weight address  grade
1   小明    male   18     170      60    北京海淀     61
2   小华  female   28     160      50    上海静安     74
3   小红  female   22     175      64    广州天河     59
4   小青    male   31     182      80    深圳南山     82
5   小兰  female   25     165      65    杭州西湖     98

In [9]:
b

    name     sex  age  height  weight address  grade
1     小明    male   18     170      60    北京海淀     61
2     小华  female   28     160      50    上海静安     74
3     小红  female   22     175      64    广州天河     59
4     小青    male   31     182      80    深圳南山     82
5     小兰  female   25     165      65    杭州西湖     98
aaa   小芳  female   24     164      52    美国加州     55

In [10]:
s = pd.Series([1,2,3,4,5])

In [11]:
b.columns.name='信息'
b.index.name='序号'

In [15]:
import openpyxl,xlrd
writer=pd.ExcelWriter('z.xlsx')
b.to_excel(writer,'Sheet1',index=False,header=False)
s.to_excel(writer,'Sheet2')
writer.save()

In [42]:
z = pd.read_excel('z.xlsx',None,header=None,index=[1])['Sheet1']
z

    0       1   2    3   4     5   6
0  小明    male  18  170  60  北京海淀  61
1  小华  female  28  160  50  上海静安  74
2  小红  female  22  175  64  广州天河  59
3  小青    male  31  182  80  深圳南山  82
4  小兰  female  25  165  65  杭州西湖  98
5  小芳  female  24  164  52  美国加州  55